alibaba/AliOS-Things/platform/mcu/saml21/saml21b/atdf/ATSAML21J16B.atdf
        <module name="DMAC" id="U2223" version="2.2.2">
          <instance name="DMAC">
            <register-group name="DMAC" name-in-module="DMAC" address-space="base" offset="0x44000400"/>
            <parameters>
              <param name="CH_BITS" value="4"/>
              <param name="CH_NUM" value="16"/>
              <param name="EVIN_NUM" value="8"/>
              <param name="EVOUT_NUM" value="8"/>
              <param name="LVL_BITS" value="2"/>
              <param name="LVL_NUM" value="4"/>
              <param name="QOSCTRL_D_RESETVALUE" value="2"/>
              <param name="QOSCTRL_F_RESETVALUE" value="2"/>
              <param name="QOSCTRL_WRB_RESETVALUE" value="2"/>
              <param name="TRIG_BITS" value="6"/>
              <param name="TRIG_NUM" value="46"/>
              <param name="INSTANCE_ID" value="129"/>
            </parameters>
          </instance>
        </module>
        <module name="DSU" id="U2209" version="2.5.0">
          <instance name="DSU">
            <register-group name="DSU" name-in-module="DSU" address-space="base" offset="0x41002000"/>
            <parameters>
              <param name="INSTANCE_ID" value="33"/>
            </parameters>
          </instance>
        </module>
        <module name="EIC" id="U2254" version="2.0.2">
          <instance name="EIC">
            <register-group name="EIC" name-in-module="EIC" address-space="base" offset="0x40002400"/>
            <signals>
              <signal group="EXTINT" index="0" function="A" pad="PA16"/>
              <signal group="EXTINT" index="0" function="A" pad="PB00"/>
              <signal group="EXTINT" index="0" function="A" pad="PB16"/>
              <signal group="EXTINT" index="0" function="A" pad="PA00"/>
              <signal group="EXTINT" index="1" function="A" pad="PA17"/>
              <signal group="EXTINT" index="1" function="A" pad="PB01"/>
              <signal group="EXTINT" index="1" function="A" pad="PB17"/>
              <signal group="EXTINT" index="1" function="A" pad="PA01"/>
              <signal group="EXTINT" index="2" function="A" pad="PA02"/>
              <signal group="EXTINT" index="2" function="A" pad="PA18"/>
              <signal group="EXTINT" index="2" function="A" pad="PB02"/>
              <signal group="EXTINT" index="3" function="A" pad="PA03"/>
              <signal group="EXTINT" index="3" function="A" pad="PA19"/>
              <signal group="EXTINT" index="3" function="A" pad="PB03"/>
              <signal group="EXTINT" index="4" function="A" pad="PA04"/>
              <signal group="EXTINT" index="4" function="A" pad="PA20"/>
              <signal group="EXTINT" index="4" function="A" pad="PB04"/>
              <signal group="EXTINT" index="5" function="A" pad="PA05"/>
              <signal group="EXTINT" index="5" function="A" pad="PA21"/>
              <signal group="EXTINT" index="5" function="A" pad="PB05"/>
              <signal group="EXTINT" index="6" function="A" pad="PA06"/>
              <signal group="EXTINT" index="6" function="A" pad="PA22"/>
              <signal group="EXTINT" index="6" function="A" pad="PB06"/>
              <signal group="EXTINT" index="6" function="A" pad="PB22"/>
              <signal group="EXTINT" index="7" function="A" pad="PA07"/>
              <signal group="EXTINT" index="7" function="A" pad="PA23"/>
              <signal group="EXTINT" index="7" function="A" pad="PB07"/>
              <signal group="EXTINT" index="7" function="A" pad="PB23"/>
              <signal group="EXTINT" index="8" function="A" pad="PB08"/>
              <signal group="EXTINT" index="9" function="A" pad="PA09"/>
              <signal group="EXTINT" index="9" function="A" pad="PB09"/>
              <signal group="EXTINT" index="10" function="A" pad="PA10"/>
              <signal group="EXTINT" index="10" function="A" pad="PA30"/>
              <signal group="EXTINT" index="10" function="A" pad="PB10"/>
              <signal group="EXTINT" index="11" function="A" pad="PA11"/>
              <signal group="EXTINT" index="11" function="A" pad="PA31"/>
              <signal group="EXTINT" index="11" function="A" pad="PB11"/>
              <signal group="EXTINT" index="12" function="A" pad="PA12"/>
              <signal group="EXTINT" index="12" function="A" pad="PA24"/>
              <signal group="EXTINT" index="12" function="A" pad="PB12"/>
              <signal group="EXTINT" index="13" function="A" pad="PA13"/>
              <signal group="EXTINT" index="13" function="A" pad="PA25"/>
              <signal group="EXTINT" index="13" function="A" pad="PB13"/>
              <signal group="EXTINT" index="14" function="A" pad="PB14"/>
              <signal group="EXTINT" index="14" function="A" pad="PB30"/>
              <signal group="EXTINT" index="14" function="A" pad="PA14"/>
              <signal group="EXTINT" index="15" function="A" pad="PA27"/>
              <signal group="EXTINT" index="15" function="A" pad="PB15"/>
              <signal group="EXTINT" index="15" function="A" pad="PB31"/>
              <signal group="EXTINT" index="15" function="A" pad="PA15"/>
              <signal group="NMI" function="A" pad="PA08"/>
            </signals>
            <parameters>
              <param name="EXTINT_NUM" value="16"/>
              <param name="GCLK_ID" value="3"/>
              <param name="NUMBER_OF_CONFIG_REGS" value="2"/>
              <param name="NUMBER_OF_INTERRUPTS" value="16"/>
              <param name="INSTANCE_ID" value="9"/>
            </parameters>
          </instance>
        </module>
        <module name="EVSYS" id="U2256" version="1.0.1">
          <instance name="EVSYS">
            <register-group name="EVSYS" name-in-module="EVSYS" address-space="base" offset="0x43000000"/>
            <parameters>
              <param name="CHANNELS" value="12"/>
              <param name="CHANNELS_BITS" value="4"/>
              <param name="CHANNELS_MSB" value="11"/>
              <param name="EXTEVT_NUM" value="0"/>
              <param name="GENERATORS" value="83"/>
              <param name="GENERATORS_BITS" value="7"/>
              <param name="USERS" value="45"/>
              <param name="USERS_BITS" value="6"/>
              <param name="INSTANCE_ID" value="96"/>
            </parameters>
          </instance>
        </module>
        <module name="GCLK" id="U2122" version="1.1.1">
          <instance name="GCLK">
            <register-group name="GCLK" name-in-module="GCLK" address-space="base" offset="0x40001800"/>
            <signals>
              <signal group="IO" index="0" function="H" pad="PB14"/>
              <signal group="IO" index="0" function="H" pad="PB22"/>
              <signal group="IO" index="0" function="H" pad="PA14"/>
              <signal group="IO" index="0" function="H" pad="PA27"/>
              <signal group="IO" index="0" function="H" pad="PA30"/>
              <signal group="IO" index="1" function="H" pad="PB15"/>
              <signal group="IO" index="1" function="H" pad="PB23"/>
              <signal group="IO" index="1" function="H" pad="PA15"/>
              <signal group="IO" index="2" function="H" pad="PB16"/>
              <signal group="IO" index="2" function="H" pad="PA16"/>
              <signal group="IO" index="3" function="H" pad="PA17"/>
              <signal group="IO" index="3" function="H" pad="PB17"/>
              <signal group="IO" index="4" function="H" pad="PA10"/>
              <signal group="IO" index="4" function="H" pad="PA20"/>
              <signal group="IO" index="4" function="H" pad="PB10"/>
              <signal group="IO" index="5" function="H" pad="PA11"/>
              <signal group="IO" index="5" function="H" pad="PA21"/>
              <signal group="IO" index="5" function="H" pad="PB11"/>
              <signal group="IO" index="6" function="H" pad="PA22"/>
              <signal group="IO" index="6" function="H" pad="PB12"/>
              <signal group="IO" index="7" function="H" pad="PA23"/>
              <signal group="IO" index="7" function="H" pad="PB13"/>
            </signals>
            <parameters>
              <param name="GENDIV_BITS" value="16"/>
              <param name="GEN_BITS" value="4"/>
              <param name="GEN_NUM" value="9"/>
              <param name="GEN_NUM_MSB" value="8"/>
              <param name="GEN_SOURCE_NUM_MSB" value="8"/>
              <param name="NUM" value="36"/>
              <param name="SOURCE_BITS" value="4"/>
              <param name="SOURCE_DFLL48M" value="7"/>
              <param name="SOURCE_DPLL96M" value="8"/>
              <param name="SOURCE_GCLKGEN1" value="2"/>
              <param name="SOURCE_GCLKIN" value="1"/>
              <param name="SOURCE_NUM" value="9"/>
              <param name="SOURCE_OSCULP32K" value="3"/>
              <param name="SOURCE_OSC16M" value="6"/>
              <param name="SOURCE_OSC32K" value="4"/>
              <param name="SOURCE_XOSC" value="0"/>
              <param name="SOURCE_XOSC32K" value="5"/>
              <param name="INSTANCE_ID" value="6"/>
            </parameters>
          </instance>
        </module>
