alibaba/AliOS-Things/platform/mcu/saml21/saml21b/atdf/ATSAML21J16B.atdf
        <register modes="HOST" name="INTFLAG" offset="0x1C" rw="RW" size="2" atomic-op="clear:INTFLAG" initval="0x0000" caption="HOST Host Interrupt Flag">
          <bitfield name="HSOF" caption="Host Start Of Frame" mask="0x4"/>
          <bitfield name="RST" caption="Bus Reset" mask="0x8"/>
          <bitfield name="WAKEUP" caption="Wake Up" mask="0x10"/>
          <bitfield name="DNRSM" caption="Downstream" mask="0x20"/>
          <bitfield name="UPRSM" caption="Upstream Resume from the Device" mask="0x40"/>
          <bitfield name="RAMACER" caption="Ram Access" mask="0x80"/>
          <bitfield name="DCONN" caption="Device Connection" mask="0x100"/>
          <bitfield name="DDISC" caption="Device Disconnection" mask="0x200"/>
        </register>
        <register modes="DEVICE" name="EPINTSMRY" offset="0x20" rw="R" size="2" initval="0x0000" caption="DEVICE End Point Interrupt Summary">
          <bitfield name="EPINT0" caption="End Point 0 Interrupt" mask="0x1"/>
          <bitfield name="EPINT1" caption="End Point 1 Interrupt" mask="0x2"/>
          <bitfield name="EPINT2" caption="End Point 2 Interrupt" mask="0x4"/>
          <bitfield name="EPINT3" caption="End Point 3 Interrupt" mask="0x8"/>
          <bitfield name="EPINT4" caption="End Point 4 Interrupt" mask="0x10"/>
          <bitfield name="EPINT5" caption="End Point 5 Interrupt" mask="0x20"/>
          <bitfield name="EPINT6" caption="End Point 6 Interrupt" mask="0x40"/>
          <bitfield name="EPINT7" caption="End Point 7 Interrupt" mask="0x80"/>
        </register>
        <register modes="HOST" name="PINTSMRY" offset="0x20" rw="R" size="2" initval="0x0000" caption="HOST Pipe Interrupt Summary">
          <bitfield name="EPINT0" caption="Pipe 0 Interrupt" mask="0x1"/>
          <bitfield name="EPINT1" caption="Pipe 1 Interrupt" mask="0x2"/>
          <bitfield name="EPINT2" caption="Pipe 2 Interrupt" mask="0x4"/>
          <bitfield name="EPINT3" caption="Pipe 3 Interrupt" mask="0x8"/>
          <bitfield name="EPINT4" caption="Pipe 4 Interrupt" mask="0x10"/>
          <bitfield name="EPINT5" caption="Pipe 5 Interrupt" mask="0x20"/>
          <bitfield name="EPINT6" caption="Pipe 6 Interrupt" mask="0x40"/>
          <bitfield name="EPINT7" caption="Pipe 7 Interrupt" mask="0x80"/>
        </register>
        <register name="DESCADD" offset="0x24" rw="RW" size="4" initval="0x00000000" caption="Descriptor Address">
          <bitfield name="DESCADD" caption="Descriptor Address Value" mask="0xFFFFFFFF"/>
        </register>
        <register name="PADCAL" offset="0x28" rw="RW" size="2" initval="0x0000" caption="USB PAD Calibration">
          <bitfield name="TRANSP" caption="USB Pad Transp calibration" mask="0x1F"/>
          <bitfield name="TRANSN" caption="USB Pad Transn calibration" mask="0x7C0"/>
          <bitfield name="TRIM" caption="USB Pad Trim calibration" mask="0x7000"/>
        </register>
        <register-group modes="DEVICE" name="DEVICE_ENDPOINT" name-in-module="DEVICE_ENDPOINT" offset="0x100" count="8"/>
        <register-group modes="HOST" name="HOST_PIPE" name-in-module="HOST_PIPE" offset="0x100" count="8"/>
      </register-group>
      <register-group name="USB_DESCRIPTOR" caption="Universal Serial Bus" section="hsram">
        <mode name="DEVICE" qualifier="USB.CTRLA.MODE" value="0" caption="USB is Device"/>
        <mode name="HOST" qualifier="USB.CTRLA.MODE" value="1" caption="USB is Host"/>
        <register-group modes="DEVICE" name="DEVICE_DESC_BANK" name-in-module="DEVICE_DESC_BANK" offset="0x000" count="2"/>
        <register-group modes="HOST" name="HOST_DESC_BANK" name-in-module="HOST_DESC_BANK" offset="0x000" count="2"/>
      </register-group>
      <value-group name="USB_CTRLA__MODE">
        <value name="DEVICE" caption="Device Mode" value="0"/>
        <value name="HOST" caption="Host Mode" value="1"/>
      </value-group>
      <value-group name="USB_DEVICE_CTRLB__LPMHDSK">
        <value name="NO" caption="No handshake. LPM is not supported" value="0"/>
        <value name="ACK" caption="ACK" value="1"/>
        <value name="NYET" caption="NYET" value="2"/>
        <value name="STALL" caption="STALL" value="3"/>
      </value-group>
      <value-group name="USB_DEVICE_CTRLB__SPDCONF">
        <value name="FS" caption="FS : Full Speed" value="0x0"/>
        <value name="LS" caption="LS : Low Speed" value="0x1"/>
        <value name="HS" caption="HS : High Speed capable" value="0x2"/>
        <value name="HSTM" caption="HSTM: High Speed Test Mode (force high-speed mode for test mode)" value="0x3"/>
      </value-group>
      <value-group name="USB_HOST_CTRLB__SPDCONF">
        <value name="NORMAL" caption="Normal mode: the host starts in full-speed mode and performs a high-speed reset to switch to the high speed mode if the downstream peripheral is high-speed capable." value="0x0"/>
        <value name="FS" caption="Full-speed: the host remains in full-speed mode whatever is the peripheral speed capability. Relevant in UTMI mode only." value="0x3"/>
      </value-group>
      <value-group name="USB_DEVICE_STATUS__LINESTATE">
        <value name="0" caption="SE0/RESET" value="0x0"/>
        <value name="1" caption="FS-J or LS-K State" value="0x1"/>
        <value name="2" caption="FS-K or LS-J State" value="0x2"/>
      </value-group>
      <value-group name="USB_DEVICE_STATUS__SPEED">
        <value name="FS" caption="Full-speed mode" value="0x0"/>
        <value name="HS" caption="High-speed mode" value="0x1"/>
        <value name="LS" caption="Low-speed mode" value="0x2"/>
      </value-group>
      <value-group name="USB_FSMSTATUS__FSMSTATE">
        <value name="OFF" caption="OFF (L3). It corresponds to the powered-off, disconnected, and disabled state" value="0x1"/>
        <value name="ON" caption="ON (L0). It corresponds to the Idle and Active states" value="0x2"/>
        <value name="SUSPEND" caption="SUSPEND (L2)" value="0x4"/>
        <value name="SLEEP" caption="SLEEP (L1)" value="0x8"/>
        <value name="DNRESUME" caption="DNRESUME. Down Stream Resume." value="0x10"/>
        <value name="UPRESUME" caption="UPRESUME. Up Stream Resume." value="0x20"/>
        <value name="RESET" caption="RESET. USB lines Reset." value="0x40"/>
      </value-group>
    </module>
    <module name="WDT" id="U2251" version="1.0.1" caption="Watchdog Timer">
      <register-group name="WDT" caption="Watchdog Timer">
        <register name="CTRLA" offset="0x0" rw="RW" access="WSYNC" size="1" initval="0x00" caption="Control">
          <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
          <bitfield name="WEN" caption="Watchdog Timer Window Mode Enable" mask="0x4"/>
          <bitfield name="ALWAYSON" caption="Always-On" mask="0x80"/>
        </register>
